Autodesk.Revit.DB.Plumbing.IPipePlumbingFixtureFlowServer.GetHtmlDescription
The method that Revit will invoke to get an HTML formatted description of the server.
Remarks:
The HTML description is used by Revit unless it is empty or the server is not available, in which case, Revit will use the plain text description from IExternalServer.GetDescription().
Returns:
The HTML format description of the server.
Since:
2014

Autodesk.Revit.DB.Plumbing.IPipePlumbingFixtureFlowServer.GetInformationLink
The method that Revit will invoke to obtain a URL address which provides more information about the server.
Returns:
The URL providing server information.
Since:
2014

Autodesk.Revit.DB.Plumbing.IPipePlumbingFixtureFlowServer.Calculate(Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData)
Calculate the pipe plumbing fixture flow.
data:
The input and output data of the calculation.
Since:
2014

Autodesk.Revit.DB.Plumbing.IPipePlumbingFixtureFlowServer
Interface class for external servers implementing Pipe plumbing fixture flow calculation.
Remarks:
A typical way to use the external server can be:
Implement a server class that derives from this interface Create a new server object and register it with the service, see ExternalServiceRegistry.Assign server for the plumbing flow conversion in PipeSettings.
Since:
2014